axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_usart.c
/*****************************************************************************
 * Copyright (c) 2022, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
*\*\file n32g401f8s7_1_usart.c
*\*\author Nations
*\*\version v1.0.0
*\*\copyright Copyright (c) 2022, Nations Technologies Inc. All rights reserved.
**/

#include "n32g401f8s7_1_usart.h"
#include "n32g401f8s7_1_rcc.h"


/**
*\*\name    USART_Reset
*\*\fun     Reset the USARTx registers.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\return  none
**/

void USART_Reset(USART_Module* USARTx)
{

    if (USARTx == UART1)
    {
        /* UART1 Reset */
        RCC_APB2_Peripheral_Reset(RCC_APB2_PERIPH_UART1);
    }
    else if (USARTx == USART2)
    {
        /* USART2 Reset */
        RCC_APB1_Peripheral_Reset(RCC_APB1_PERIPH_USART2);
    }
    else if (USARTx == UART4)
    {
        /* UART4 Reset */
        RCC_APB2_Peripheral_Reset(RCC_APB2_PERIPH_UART4);
    }
}

/**
*\*\name    USART_Initializes
*\*\fun     Initializes the USARTx peripheral according to USART_InitStruct .
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   USART_InitStruct :
*\*\          - buad_rate :
*\*\            - (((buad_rate) > 0) && ((buad_rate) < 0x00337F99))
*\*\          - WordLength
*\*\            - USART_WL_8B
*\*\            - USART_WL_9B
*\*\          - StopBits
*\*\            - USART_STPB_1
*\*\            - USART_STPB_0_5
*\*\            - USART_STPB_2
*\*\            - USART_STPB_1_5
*\*\          - Parity
*\*\            - USART_PE_NO
*\*\            - USART_PE_EVEN
*\*\            - USART_PE_ODD
*\*\          - Mode
*\*\            - USART_MODE_RX
*\*\            - USART_MODE_TX
*\*\          - HardwareFlowControl
*\*\            - USART_HFCTRL_NONE
*\*\            - USART_HFCTRL_RTS
*\*\            - USART_HFCTRL_CTS
*\*\            - USART_HFCTRL_RTS_CTS
*\*\return  none
**/

void USART_Initializes(USART_Module* USARTx, USART_InitType* USART_InitStruct)
{
    USART_Baud_Rate_Config(USARTx,USART_InitStruct->BaudRate);
    USART_Word_Length_Config(USARTx,USART_InitStruct->WordLength);
    USART_Stop_Bits_Config(USARTx,USART_InitStruct->StopBits);
    USART_Parity_Config(USARTx,USART_InitStruct->Parity);
    USART_Mode_Config(USARTx,USART_InitStruct->Mode);  
    USART_Hardware_Flow_Control_Config(USARTx,USART_InitStruct->HardwareFlowControl);  
}

/**
*\*\name    USART_Baud_Rate_Config
*\*\fun     Configure the baud rate of the USART.
*\*\          The baud rate is computed using the following formula:
*\*\          - IntegerDivider = ((PCLKx) / (16 * (USART_InitStruct->BaudRate)))
*\*\          - FractionalDivider = ((IntegerDivider - ((u32) IntegerDivider)) * 16) + 0.5 
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   buad_rate :
*\*\          - (((buad_rate) > 0) && ((buad_rate) < 0x00337F99))
*\*\return  none
**/
void USART_Baud_Rate_Config(USART_Module* USARTx,uint32_t buad_rate)
{
    uint32_t temp_value = 0x00, apb_clock_value = 0x00;
    uint32_t integer_divider_value    = 0x00;
    uint32_t fractional_divider_value = 0x00;
    uint32_t base_value        = 0;
    RCC_ClocksType RCC_ClocksStatus; 
    base_value = (uint32_t)USARTx;       
    RCC_Clocks_Frequencies_Value_Get(&RCC_ClocksStatus);
    if ((base_value == UART1_BASE) || (base_value == UART4_BASE))
    {
        apb_clock_value = RCC_ClocksStatus.Pclk2Freq;
    }
    else
    {
        apb_clock_value = RCC_ClocksStatus.Pclk1Freq;
    }

    /* Determine the integer part */
    integer_divider_value = ((25 * apb_clock_value) / (4 * buad_rate));
    temp_value = (integer_divider_value / 100) << USART_BUAD_INTEGER_OFFSET;

    /* Determine the fractional part */
    fractional_divider_value = integer_divider_value - (100 * (temp_value >> USART_BUAD_FRACTIONAL_OFFSET));

    /* Implement the fractional part in the register */   
    temp_value |= ((((fractional_divider_value * 16) + 50) / 100)) & ((uint8_t)0x0F);

    /* Write to USART PBC */
    USARTx->BRCF = (uint16_t)temp_value;

}

/**
*\*\name    USART_Word_Length_Config
*\*\fun     Configure the word length of the USART.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   word_length :
*\*\            - USART_WL_8B
*\*\            - USART_WL_9B
*\*\return  none
**/
void USART_Word_Length_Config(USART_Module* USARTx,uint16_t word_length)
{
    uint32_t temp_value   = 0x00; 
    temp_value = USARTx->CTRL1;    
    /* Clear M bit */
    temp_value &= USART_WL_MASK;
    /* Configure the USART Word Length */
    temp_value |= word_length;
    USARTx->CTRL1 = (uint16_t)temp_value;

