axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_usart.c
    *(__IO uint32_t*)base_value |= temp_value;

}

/**
*\*\name    USART_Interrput_Disable.
*\*\fun     Disables the specified USART interrupts.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   USART_interrupt :
*\*\          - USART_INT_PEF
*\*\          - USART_INT_TXDE
*\*\          - USART_INT_TXC
*\*\          - USART_INT_RXDNE
*\*\          - USART_INT_IDLEF
*\*\          - USART_INT_LINBD
*\*\          - USART_INT_CTSF
*\*\          - USART_INT_ERRF
*\*\return  none
**/

void USART_Interrput_Disable(USART_Module* USARTx, uint16_t USART_interrupt)
{
    uint32_t register_value = 0x00, interrupt_position = 0x00, temp_value = 0x00;
    uint32_t base_value = 0x00;
    base_value = (uint32_t)USARTx;

    /* Get the USART register index */
    register_value = (((uint8_t)USART_interrupt) >> USART_CTRL_INDEX_OFFSET);

    /* Get the interrupt position */
    interrupt_position  = USART_interrupt & INT_MASK;
    temp_value = (((uint32_t)0x01) << interrupt_position);

    if (register_value == 0x01) /* The IT is in CTRL1 register */
    {
        base_value += 0x0C;
    }
    else if (register_value == 0x02) /* The IT is in CTRL2 register */
    {
        base_value += 0x10;
    }
    else /* The IT is in CTRL3 register */
    {
        base_value += 0x14;
    }

    *(__IO uint32_t*)base_value &= ~temp_value;

}

/**
*\*\name    USART_DMA_Transfer_Enable.
*\*\fun     Enables the DMA transfer for selected requests.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   USART_DMA_request :
*\*\          - USART_DMAREQ_TX
*\*\          - USART_DMAREQ_RX
*\*\return  none
**/

void USART_DMA_Transfer_Enable(USART_Module* USARTx, uint16_t USART_DMA_request)
{

    /* Enable the DMA transfer for selected requests by setting the DMAT and/or
        DADDR bits in the USART CTRL3 register */
    USARTx->CTRL3 |= USART_DMA_request;

}

/**
*\*\name    USART_DMA_Transfer_Disable.
*\*\fun     Disables the DMA transfer for selected requests.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   USART_DMA_request :
*\*\          - USART_DMAREQ_TX
*\*\          - USART_DMAREQ_RX
*\*\return  none
**/

void USART_DMA_Transfer_Disable(USART_Module* USARTx, uint16_t USART_DMA_request)
{


    /* Disable the DMA transfer for selected requests by clearing the DMAT and/or
        DADDR bits in the USART CTRL3 register */
    USARTx->CTRL3 &= (uint16_t)~USART_DMA_request;

}

/**
*\*\name    USART_Address_Set.
*\*\fun     Sets the address of the USART node.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   USART_address :
*\*\          - (((USART_address)>=0x00)&&((USART_address)<0x10))
*\*\return  none
**/

void USART_Address_Set(USART_Module* USARTx, uint8_t USART_address)
{
    /* Clear the USART address */
    USARTx->CTRL2 &= CTRL2_ADDR_MASK;
    /* Set the USART address node */
    USARTx->CTRL2 |= USART_address;
}

/**
*\*\name    USART_WakeUp_Mode_Set.
*\*\fun     Selects the USART WakeUp method.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   USART_wake_up_mode :
*\*\          - USART_WUM_IDLELINE
*\*\          - USART_WUM_ADDRMASK
*\*\return  none
**/

void USART_WakeUp_Mode_Set(USART_Module* USARTx, uint16_t USART_wake_up_mode)
{

    USARTx->CTRL1 &= CTRL1_WUM_MASK;
    USARTx->CTRL1 |= USART_wake_up_mode;
}

/**
*\*\name    USART_Receiver_Wakeup_Enable.
*\*\fun     Enable the USART mute mode.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\return  none
**/
void USART_Receiver_Wakeup_Enable(USART_Module* USARTx)
{
    /* Enable the USART mute mode  by setting the RWU bit in the CTRL1 register */
    USARTx->CTRL1 |= CTRL1_RCVWU_SET;
}

/**
*\*\name    USART_Receiver_Wakeup_Disable.
*\*\fun     Disable the USART mute mode.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\return  none
**/
void USART_Receiver_Wakeup_Disable(USART_Module* USARTx)
{
    /* Disable the USART mute mode by clearing the RWU bit in the CTRL1 register */
    USARTx->CTRL1 &= CTRL1_RCVWU_RESET;

}

/**
*\*\name    USART_LIN_Break_Detect_Length_Set.
*\*\fun     Sets the USART LIN Break detection length.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   USART_LIN_break_detect_length :
*\*\          - USART_LINBDL_10B
*\*\          - USART_LINBDL_11B
*\*\return  none
**/
void USART_LIN_Break_Detect_Length_Set(USART_Module* USARTx, uint16_t USART_LIN_break_detect_length)
{
    USARTx->CTRL2 &= CTRL2_LINBDL_MASK;
    USARTx->CTRL2 |= USART_LIN_break_detect_length;
}

/**
*\*\name    USART_LIN_Enable.
*\*\fun     Enables the USART's LIN mode.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\return  none
**/
void USART_LIN_Enable(USART_Module* USARTx)
{

    /* Enable the LIN mode by setting the LINEN bit in the CTRL2 register */
    USARTx->CTRL2 |= CTRL2_LINMEN_SET;

}

/**
*\*\name    USART_LIN_Disable.
*\*\fun     Disables the USART's LIN mode.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\return  none
**/
void USART_LIN_Disable(USART_Module* USARTx)
{
    /* Disable the LIN mode by clearing the LINEN bit in the CTRL2 register */
    USARTx->CTRL2 &= CTRL2_LINMEN_RESET;
}

/**
*\*\name    USART_Data_Send.
*\*\fun     Transmits single data through the USARTx peripheral.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   data :
*\*\          - The data to transmit.
*\*\return  none
**/
void USART_Data_Send(USART_Module* USARTx, uint16_t data)
{
    /* Transmit Data */
    USARTx->DAT = (data & (uint16_t)0x01FF);
}

/**
*\*\name    USART_Data_Receive.
*\*\fun     Returns the most recent received data by the USARTx peripheral.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\return  The received data.
**/
uint16_t USART_Data_Receive(USART_Module* USARTx)
{
    /* Receive Data */
    return (uint16_t)(USARTx->DAT & (uint16_t)0x01FF);
}

/**
*\*\name    USART_Break_Frame_Send.
*\*\fun     Transmits break characters.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\return  none
**/
void USART_Break_Frame_Send(USART_Module* USARTx)
{
    /* Send break characters */
    USARTx->CTRL1 |= CTRL1_SDBRK_SET;
}

/**
*\*\name    USART_Guard_Time_Set.
*\*\fun     Sets the specified USART guard time.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\param   USART_guard_time :
*\*\          - Specifies the guard time
*\*\return  none
**/
void USART_Guard_Time_Set(USART_Module* USARTx, uint8_t USART_guard_time)
{
    /* Clear the USART Guard time */
    USARTx->GTP &= GTP_LSB_MASK;
    /* Set the USART guard time */
    USARTx->GTP |= (uint16_t)((uint16_t)USART_guard_time << USART_GTP_GTV_OFFSET);
}

/**
*\*\name    USART_prescaler_Set.
*\*\fun     Sets the system clock prescaler.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   USART_prescaler :
*\*\          - Specifies the prescaler clock.
*\*\return  none
**/
void USART_Prescaler_Set(USART_Module* USARTx, uint8_t USART_prescaler)
{
    /* Clear the USART prescaler */
    USARTx->GTP &= GTP_MSB_MASK;
    /* Set the USART prescaler */
    USARTx->GTP |= USART_prescaler;
}

/**
*\*\name    USART_Smart_Card_Enable.
*\*\fun     Enables the USART's Smart Card mode.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\return  none
**/

void USART_Smart_Card_Enable(USART_Module* USARTx)
{

    
    /* Enable the SC mode by setting the SCEN bit in the CTRL3 register */
    USARTx->CTRL3 |= CTRL3_SCMEN_SET;

