axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_usart.c
}

/**
*\*\name    USART_Smart_Card_Disable.
*\*\fun     Disables the USART's Smart Card mode.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\return  none
**/

void USART_Smart_Card_Disable(USART_Module* USARTx)
{
    /* Disable the Smart Card mode by clearing the SCEN bit in the CTRL3 register */
    USARTx->CTRL3 &= CTRL3_SCMEN_RESET;
}

/**
*\*\name    USART_Smart_Card_NACK_Enable.
*\*\fun     Enables Smart Card NACK transmission.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\return  none
**/
void USART_Smart_Card_NACK_Enable(USART_Module* USARTx)
{

    /* Enable the Smart Card NACK transmission by setting the NACK bit in the CTRL3 register */
    USARTx->CTRL3 |= CTRL3_SCNACK_SET;

}

/**
*\*\name    USART_Smart_Card_NACK_Disable.
*\*\fun     Disables NACK transmission.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\return  none
**/
void USART_Smart_Card_NACK_Disable(USART_Module* USARTx)
{

    /* Disable the NACK transmission by clearing the NACK bit in the CTRL3 register */
    USARTx->CTRL3 &= CTRL3_SCNACK_RESET;

}

/**
*\*\name    USART_Half_Duplex_Enable.
*\*\fun     Enables the USART's Half Duplex communication.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\return  none
**/

void USART_Half_Duplex_Enable(USART_Module* USARTx)
{

    /* Enable the Half-Duplex mode by setting the HDSEL bit in the CTRL3 register */
    USARTx->CTRL3 |= CTRL3_HDMEN_SET;

}

/**
*\*\name    USART_Half_Duplex_Disable.
*\*\fun     Disables the USART's Half Duplex communication.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\return  none
**/

void USART_Half_Duplex_Disable(USART_Module* USARTx)
{

    /* Disable the Half-Duplex mode by clearing the HDSEL bit in the CTRL3 register */
    USARTx->CTRL3 &= CTRL3_HDMEN_RESET;

}

/**
*\*\name    USART_IrDA_Mode_Set.
*\*\fun     Configures the USART's IrDA interface.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   USART_IrDA_mode :
*\*\          - USART_IRDAMODE_LOWPPWER
*\*\          - USART_IRDAMODE_NORMAL
*\*\return  none
**/

void USART_IrDA_Mode_Set(USART_Module* USARTx, uint16_t USART_IrDA_mode)
{

    USARTx->CTRL3 &= CTRL3_IRDALP_MASK;
    USARTx->CTRL3 |= USART_IrDA_mode;
}

/**
*\*\name    USART_IrDA_Enable.
*\*\fun     Enables the USART's IrDA interface.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\return  none
**/

void USART_IrDA_Enable(USART_Module* USARTx)
{

    /* Enable the IrDA mode by setting the IREN bit in the CTRL3 register */
    USARTx->CTRL3 |= CTRL3_IRDAMEN_SET;

}

/**
*\*\name    USART_IrDA_Disable.
*\*\fun     Disables the USART's IrDA interface.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\return  none
**/

void USART_IrDA_Disable(USART_Module* USARTx)
{

    /* Disable the IrDA mode by clearing the IREN bit in the CTRL3 register */
    USARTx->CTRL3 &= CTRL3_IRDAMEN_RESET;

}

/**
*\*\name    USART_Flag_Status_Get.
*\*\fun     Checks whether the specified USART flag is set or not.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   USART_flag :
*\*\          - USART_FLAG_CTSF
*\*\          - USART_FLAG_LINBD
*\*\          - USART_FLAG_TXDE
*\*\          - USART_FLAG_TXC
*\*\          - USART_FLAG_RXDNE
*\*\          - USART_FLAG_IDLEF
*\*\          - USART_FLAG_OREF
*\*\          - USART_FLAG_NEF
*\*\          - USART_FLAG_FEF
*\*\          - USART_FLAG_PEF
*\*\return  SET or RESET
**/

FlagStatus USART_Flag_Status_Get(USART_Module* USARTx, uint16_t USART_flag)
{

    if ((USARTx->STS & USART_flag) != (uint16_t)RESET)
    {
       return SET;
    }
    else
    {
        return RESET;
    }

}

/**
*\*\name    USART_Flag_Clear.
*\*\fun     Clears the USARTx's pending flags.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   USART_flag :
*\*\          - USART_FLAG_CTSF
*\*\          - USART_FLAG_LINBD
*\*\          - USART_FLAG_TXC
*\*\          - USART_FLAG_RXDNE
*\*\return  none
**/

void USART_Flag_Clear(USART_Module* USARTx, uint16_t USART_flag)
{

    USARTx->STS = (uint16_t)~USART_flag;
}

/**
*\*\name    USART_Interrupt_Status_Get.
*\*\fun     Checks whether the specified USART interrupt has occurred or not.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   USART_interrupt :
*\*\          - USART_INT_CTSF
*\*\          - USART_INT_LINBD
*\*\          - USART_INT_TXDE
*\*\          - USART_INT_TXC
*\*\          - USART_INT_RXDNE
*\*\          - USART_INT_IDLEF
*\*\          - USART_INT_OREF
*\*\          - USART_INT_NEF
*\*\          - USART_INT_FEF
*\*\          - USART_INT_PEF
*\*\return  SET or RESET
**/

INTStatus USART_Interrupt_Status_Get(USART_Module* USARTx, uint16_t USART_interrupt)
{
    uint32_t bit_position = 0x00, temp_value = 0x00, register_value = 0x00;



    /* Get the USART register index */
    register_value = (((uint8_t)USART_interrupt) >> USART_CTRL_INDEX_OFFSET);
    /* Get the interrupt position */
    temp_value = USART_interrupt & INT_MASK;
    temp_value = (uint32_t)0x01 << temp_value;

    if (register_value == 0x01) /* The IT  is in CTRL1 register */
    {
        temp_value &= USARTx->CTRL1;
    }
    else if (register_value == 0x02) /* The IT  is in CTRL2 register */
    {
        temp_value &= USARTx->CTRL2;
    }
    else /* The IT  is in CTRL3 register */
    {
        temp_value &= USARTx->CTRL3;
    }

    bit_position = USART_interrupt >> USART_STS_INT_BIT_OFFSET;
    bit_position = (uint32_t)0x01 << bit_position;
    bit_position &= USARTx->STS;
    if ((temp_value != (uint16_t)RESET) && (bit_position != (uint16_t)RESET))
    {
        return SET;
    }
    else
    {
        return RESET;
    }


}

/**
*\*\name    USART_Interrupt_Status_Clear.
*\*\fun     Clears the USARTx's interrupt Status.
*\*\param   USARTx :
*\*\          - UART1
*\*\          - USART2
*\*\          - UART4
*\*\param   USART_Interrupt :
*\*\          - USART_INT_CTSF
*\*\          - USART_INT_LINBD
*\*\          - USART_INT_TXC
*\*\          - USART_INT_RXDNE
*\*\return  none
**/

void USART_Interrupt_Status_Clear(USART_Module* USARTx, uint16_t USART_Interrupt)
{
    uint16_t bit_position = 0x00, temp_value = 0x00;

    bit_position      = USART_Interrupt >> USART_STS_INT_BIT_OFFSET;
    temp_value    = ((uint16_t)0x01 << (uint16_t)bit_position);
    USARTx->STS = (uint16_t)~temp_value;
}

